In [1]:
import pandas as pd

In [2]:
# empty dataframe example
df = pd.DataFrame()

In [4]:
df.head()

Empty DataFrame
Columns: []
Index: []

In [6]:
books = [
    {
        "title": "Visual Display of Quantitative Information",
        "author": "Edward Tufte"
    },
    {
        "title": "Weapons of Math Destructions",
        "author": "Kathy O'Neill AKA Mathbabe"
    },
    {
        "title": "Signal and the Noise",
        "author": "Nate Silver"
    },
]

In [7]:

df = pd.DataFrame(books)
df

                                        title                      author
0  Visual Display of Quantitative Information                Edward Tufte
1                Weapons of Math Destructions  Kathy O'Neill AKA Mathbabe
2                        Signal and the Noise                 Nate Silver

In [8]:
df.title

0    Visual Display of Quantitative Information
1                  Weapons of Math Destructions
2                          Signal and the Noise
Name: title, dtype: object

In [9]:
df["title"]

0    Visual Display of Quantitative Information
1                  Weapons of Math Destructions
2                          Signal and the Noise
Name: title, dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   3 non-null      object
 1   author  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
df.columns = df.columns.str.lower()

In [18]:
df

                                        title                      author
0  Visual Display of Quantitative Information                Edward Tufte
1                Weapons of Math Destructions  Kathy O'Neill AKA Mathbabe
2                        Signal and the Noise                 Nate Silver

In [19]:
df.describe()

                       title                      author
count                      3                           3
unique                     3                           3
top     Signal and the Noise  Kathy O'Neill AKA Mathbabe
freq                       1                           1

In [20]:
df

                                        title                      author
0  Visual Display of Quantitative Information                Edward Tufte
1                Weapons of Math Destructions  Kathy O'Neill AKA Mathbabe
2                        Signal and the Noise                 Nate Silver

In [ ]:
df.title
df["title"]

In [21]:
df["quantity"] = [10, 20, 100]

In [23]:
df["price"] = [50, 14.5, 12]

In [25]:
df["inventory_value"] = df.price * df.quantity

In [27]:
df.price = df.price * 2

In [59]:
df["inventory_value"] = df.price * df.quantity

In [32]:
df

,title,author,quantity,price,inventory_value
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [33]:
df.describe()

         quantity       price  inventory_value
count    3.000000    3.000000         3.000000
mean    43.333333   51.000000      1326.666667
std     49.328829   42.508823       952.960300
min     10.000000   24.000000       580.000000
25%     15.000000   26.500000       790.000000
50%     20.000000   29.000000      1000.000000
75%     60.000000   64.500000      1700.000000
max    100.000000  100.000000      2400.000000

In [35]:
df[["quantity", "price", "inventory_value"]]

   quantity  price  inventory_value
0        10  100.0           1000.0
1        20   29.0            580.0
2       100   24.0           2400.0

In [39]:
x = df[["title", "author"]].describe()

In [40]:
type(x)

pandas.core.frame.DataFrame

In [43]:
x.columns

Index(['title', 'author'], dtype='object')

In [46]:
type(df.dtypes)

pandas.core.series.Series

In [47]:
df.dtypes

title               object
author              object
quantity             int64
price              float64
inventory_value    float64
dtype: object

In [48]:
df.price > 30

0     True
1    False
2    False
Name: price, dtype: bool

In [49]:
df.T

,0,1,2
title,Visual Display of Quantitative Information,Weapons of Math Destructions,Signal and the Noise
author,Edward Tufte,Kathy O'Neill AKA Mathbabe,Nate Silver
quantity,10,20,100
price,100,29,24
inventory_value,1000,580,2400

In [52]:
df[df.author.str.contains("Kathy")]

,title,author,quantity,price,inventory_value
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0

In [60]:
# or is accomplished with |
# and is accomplished with & 
df[df.author.str.contains("Kathy") | df.title.str.contains("Noise")]

,title,author,quantity,price,inventory_value
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [61]:
# Mutating in place vs. returning a copy
df.drop(columns=["inventory_value"]) # .drop by default returns a copy, reassign the copy if you need the copy

,title,author,quantity,price
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0
2,Signal and the Noise,Nate Silver,100,24.0

In [62]:
x = df.drop(columns=["inventory_value"], inplace=True) #inplace mutates the original

In [64]:
type(x)

NoneType

In [65]:
df

,title,author,quantity,price
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0
2,Signal and the Noise,Nate Silver,100,24.0

In [66]:
x = df

In [69]:
x["value"] = x.quantity * x.price
x

,title,author,quantity,price,value
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [70]:
df

,title,author,quantity,price,value
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [71]:
y = df.copy()

In [73]:
y = y.drop(columns=["quantity", "price"])

In [74]:
y

,title,author,value
0,Visual Display of Quantitative Information,Edward Tufte,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,580.0
2,Signal and the Noise,Nate Silver,2400.0

In [77]:
df.sort_values(by="author")

,title,author,quantity,price,value
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [79]:
df.sort_values(by="price", ascending=False)

,title,author,quantity,price,value
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [80]:
df.sort_values(by="value", ascending=False)

,title,author,quantity,price,value
2,Signal and the Noise,Nate Silver,100,24.0,2400.0
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0

In [83]:
df.sort_values(by=["value", "price"])

,title,author,quantity,price,value
1,Weapons of Math Destructions,Kathy O'Neill AKA Mathbabe,20,29.0,580.0
0,Visual Display of Quantitative Information,Edward Tufte,10,100.0,1000.0
2,Signal and the Noise,Nate Silver,100,24.0,2400.0

In [87]:
df.sort_values?

In [85]:
def add_one(x):
    """ adds one to the input"""
    return x + 1

In [86]:
add_one?